# Напишите программу, которая выводит прямоугольник, по периметру состоящий из звездочек (*).
#
# Примечание. Высота и ширина прямоугольника равны 4 и 17 звёздочкам соответственно.

# print('*****************')
# print('*               *')
# print('*               *')
# print('*****************')


# Напишите программу, которая считывает два целых числа a и b и выводит на экран квадрат суммы (a+b)^2(a+b)^2
# и сумму квадратов a^2+b^2 этих чисел.

# a = int(input())
# b = int(input())
#
# kv_summ = (a + b) ** 2
# suum_kv = a * a + b * b
# print('Квадрат суммы', a, 'и', b, 'равен', kv_summ)
# print('Сумма квадратов', a, 'и', b, 'равна', suum_kv)


