# Вставьте пропущенный фрагмент кода,
# так чтобы в результате выполнения программы была выведена длина строки s.

# s = 'Python rocks!'
# print(len(s))


# Вставьте пропущенный фрагмент кода,
# так чтобы в результате выполнения программы был выведен четвертый символ строки s.

# s = 'Python rocks!'
# print(s[3])


# Вставьте пропущенный фрагмент кода,
# так чтобы в результате выполнения программы
# были выведены символы строки s со 2 по 5 включительно.

# s = 'Python rocks!'
# print(s[1:5])


# Вставьте пропущенный фрагмент кода,
# так чтобы в результате выполнения программы была
# выведена строка s без ведущих и замыкающих пробельных символов.

# s = '    Python rocks!     '
# print(s.strip())


# Вставьте пропущенный фрагмент кода,
# так чтобы в результате выполнения программы
# была выведена строка s заглавными буквами (в верхнем регистре).

# s = 'Python rocks!'
# print(s.upper())


# Вставьте пропущенный фрагмент кода,
# так чтобы в результате выполнения программы
# была выведена строка s в которой символ «o» заменен на символ «@».

s = 'Python rocks!'
print(s.replace('o', '@'))