# Напишите программу, которая принимает целое число x и определяет,
# принадлежит ли данное число указанному промежутку.

# x = int(input())
#
# if -1 < x < 17:
#     print('Принадлежит')
# else:
#     print('Не принадлежит')


# Напишите программу, которая принимает целое число x и определяет,
# принадлежит ли данное число указанным промежуткам.

x = int(input())

if -3 >= x or x >= 7:
    print('Принадлежит')
else:
    print('Не принадлежит')





