# Напишите программу, которая считывает строку-разделитель и три строки,
# а затем выводит указанные строки через разделитель.

# seep = input()
# str1 = input()
# str2 = input()
# str3 = input()
#
# print(str1, str2, str3, sep=seep)


# Напишите программу, которая приветствует пользователя,
# выводя слово «Привет» (без кавычек), после которого должна стоять запятая и пробел,
# а затем введенное имя и восклицательный знак.


name = input()
print('Привет, ', name, end='!')
