# Дополните приведенный код, используя индексатор, так чтобы он вывел 17-ый элемент списка primes.

# primes = [2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71]
#
# print(primes[16])


# Дополните приведенный код, используя индексатор, так чтобы он вывел последний элемент списка primes.

# primes = [2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71]
#
# print(primes[-1])


# Дополните приведенный код, используя срезы, так чтобы он вывел первые 6 элементов списка primes.

# primes = [2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71]
#
# print(primes[:6])

# Дополните приведенный код, так чтобы он вывел сумму минимального и максимального элементов списка numbers.

# numbers = [12.5, 3.1415, 2.718, 9.8, 1.414, 1.1618, 1.324]
#
# print((max(numbers) + min(numbers)))