# Напишите программу, которая считывает длины двух катетов в
# прямоугольном треугольнике и выводит его площадь.

# a = float(input())
# b = float(input())
#
# s = 0.5 * a * b
# print(s)

# Две старушки идут навстречу друг другу с постоянными скоростями V1 и V2 км/ч.
# Определите, через какое время старушки встретятся, если расстояние между ними равно S км.

s = float(input())
v1 = float(input())
v2 = float(input())

h = s / (v1 + v2)
print(h)



