# На плоскости евклидово расстояние между двумя точками(x1;y1) b (x2;y2)
# num1 = float(input())
# num2 = float(input())
# num3 = float(input())
# num4 = float(input())
#
# p = ((num1 - num3) ** 2 + (num2 - num4) ** 2) ** 0.5
#
# print(p)

# Напишите программу определяющую площадь круга и длину окружности по заданному радиусу R.
from math import pi
r = float(input())
p = pi
S = p * (r ** 2)
C = 2 * p * r
print(S)
print(C)



