# Напишите программу вывода на экран трех последовательно идущих чисел, каждое на отдельной строке.
# Первое число вводит пользователь, остальные числа вычисляются в программе.

num1 = int(input())

num2 = num1 + 1
num3 = num2 + 1
print(num1)
print(num2)
print(num3)
