# Напишите программу вывода на экран трех последовательно идущих чисел, каждое на отдельной строке.
# Первое число вводит пользователь, остальные числа вычисляются в программе.

# num1 = int(input())
#
# num2 = num1 + 1
# num3 = num2 + 1
# print(num1)
# print(num2)
# print(num3)


# Напишите программу, которая считывает три целых числа и выводит на экран их сумму.
# Каждое число записано в отдельной строке.

# num1 = int(input())
# num2 = int(input())
# num3 = int(input())
#
# summ = num1 + num2 + num3
# print(summ)


# Напишите программу, вычисляющую объём куба и площадь его полной поверхности, по введённому значению длины ребра.

storona = int(input())
v = storona * storona * storona
s = 6 * (storona * storona)
print('Объем =', v)
print('Площадь полной поверхности =', s)


