# На вход программе подается строка состоящая из имени и фамилии человека,
# разделенных одним пробелом.
# Напишите программу, которая проверяет,
# что имя и фамилия начинаются с заглавной буквы.

# name = input()
# if name.istitle() == True:
#     print('YES')
# else:
#     print('NO')


# На вход программе подается строка.
# Напишите программу, которая меняет регистр символов,
# другими словами замените все строчные символы заглавными и наоборот.

text = input()
print(text.swapcase())
