# Напишите программу вывода на экран трех последовательно идущих чисел, каждое на отдельной строке.
# Первое число вводит пользователь, остальные числа вычисляются в программе.

# num1 = int(input())
#
# num2 = num1 + 1
# num3 = num2 + 1
# print(num1)
# print(num2)
# print(num3)


# Напишите программу, которая считывает три целых числа и выводит на экран их сумму.
# Каждое число записано в отдельной строке.

# num1 = int(input())
# num2 = int(input())
# num3 = int(input())
#
# summ = num1 + num2 + num3
# print(summ)


# Напишите программу, вычисляющую объём куба и площадь его полной поверхности, по введённому значению длины ребра.

# storona = int(input())
# v = storona * storona * storona
# s = 6 * (storona * storona)
# print('Объем =', v)
# print('Площадь полной поверхности =', s)


# Напишите программу вычисления значения функции f(a, b) = 3(a + b)^3 + 275b^2 - 127a - 41
# по введеным целым значениям a и b.

# a = int(input())
# b = int(input())
#
# f = 3 * ((a + b) * (a + b) * (a + b)) + 275 * (b * b) - 127 * a - 41
# print(f)

# Напишите программу, которая считывает целое число,
# после чего на экран выводится следующее и предыдущее целое число с пояснительным текстом.

# num = int(input())
# next_num = num + 1
# previous_num = num - 1
#
# print('Следующее за числом', num, 'число: ', next_num)
# print('Для числа', num, 'предыдущее число: ', previous_num)

# Напишите программу, которая считает стоимость трех компьютеров,
# состоящих из монитора, системного блока, клавиатуры и мыши.

monitor = int(input())
computer_system = int(input())
keyboard = int(input())
mouse = int(input())

pay_computer = (monitor + computer_system + keyboard + mouse) * 3
print(pay_computer)





