# Напишите программу, которая считывает три строки по очереди,
# а затем выводит их в обратной последовательности, каждую на отдельной строчке.

str1 = input()
str2 = input()
str3 = input()
print(str3)
print(str2)
print(str1)
